{ "_id" : { "$oid" : "5012a552d3ef88e703f9d8a7" }, "c" : "<p>The Uploader is how you get media on Median. It is available to any logged-in user. Median accepts <b>five</b> different types of media entry: video, audio, image, document, and link. The first four are file-based and can be accepted in batches of up to five files at a time. Links can only be submitted one at a time. While there is no technical limit to the maximum upload file size, since the quality of your internet connection determines how much you can reasonably upload at once, there is a generally accepted limit of 4-5GB total per upload. This limit can be four 1GB files or one large 4GB file.</p>\r\n\r\n<p>The Uploader can be done by just uploading content and submitting the form. Median employs a number of default settings that are intended to secure your media. Alternatively, you can fill out the entire Uploader and select your own settings, then save them as <b>Defaults</b> so every time you use the Uploader, those settings will be used. The default Median settings are to set the licensing of the media as \"Unknown\", restrict the content to the Emerson Community, place it in the Uncategorized category, and set the uploading user as the sole owner of the entry.</p>\r\n\r\n<p>When uploading more than one file at a time, <b>all of the settings are attributed to those files</b> except the titles. So if you decide to upload five videos at once, and you add them to a class in the Uploader, all of them will be added to that class. You can always edit the entries individually later, or bulk-add them to classes through the Manage page.</p>\r\n\r\n<p>Classes, categories, events, and groups will only be available to you if you have access to them. You may see no events available for selection in the Uploader because none are available at the time. Any groups you are a member of will be listed as potential owners.</p>\r\n\r\n<p>Media Info, or Metadata, is entirely optional. The <b>Notes</b> field will be used as its iTunes Summary if your content is in an RSS feed.</p>\r\n\r\n<p>If you wish to have multiple owners of the media entry but show only one of them as the owner on its player page, use the <b>Show Owner As</b> field under \"Privacy & Ownership\".</p>\r\n\r\n<p>Also note that all privacy, access, and permission settings are <b>cascading</b>, except for ownership. This means that if you set your media to be Class-Only and also make it password-protected, anyone viewing it will need to be both in the class and know the password. All privacy, access, and permission settings must be fulfilled to view the entry. The only way around this restriction is to be an owner of the entry.</p>", "k" : "uploader", "ti" : "The Uploader", "tsc" : 1343403548, "tsu" : { "$numberLong" : "1412264394" }, "v" : 1 }
{ "_id" : { "$oid" : "5012a56ad3ef88e703f9d8a8" }, "c" : "<p><i><b>What does \"[your media] needs to be transcoded at least once before being viewable\" mean?</b></i></p>\r\n\r\n<p>This means that the video file you uploaded is not compatible with Median's video player. Median will transcode the file for you to make it compatible, which may take anywhere from five minutes to 24 hours depending on how many other videos need to be transcoded. You can check on the status of the farm here: <a href=\"/farming.php\">the Farm</a>.</p>\r\n\r\n<p><i><b>What does \"The file was encoded with Apple Proprietary codecs, so it cannot be used by Median.\" mean?</b></i></p>\r\n\r\n<p>This means that the video file you uploaded cannot be transcoded or played back by Median because it was encoded using proprietary codecs like XDCAM or ProRes. To upload it to Median, you have to re-export it from Final Cut or Compressor to a more friendly format like H264. Apple proprietary formats are also extremely large, so it's a good idea to compress them to a more mobile codec.</p>\r\n\r\n<p><i><b>The video is not immediately available, but I encoded it properly! Why?</b></i></p>\r\n\r\n<p>Make sure the file format is <b>MP4</b>, not <b>MOV</b>. Make sure the video/audio codecs you used are <b>H.264</b> for video and <b>AAC</b> for audio. Additionally, to be immediately available, the video must be <b>less than 1900kbps</b> total bitrate, and 720p (1280x720) or lower resolution. If you open the file in Quicktime, you can go to <i>Window > Movie Inspector</i> (or press Command-I) and it will tell you what codecs the video is using as well as what bitrate the file plays at. It's common to accidentally use Apple MPEG-4 video codec, or to forget to encode the audio to AAC. If you believe you have done so but your entry still isn't immediately available, please do not hesitate to <a href=\"/contact/\">contact support</a>.</p>\r\n\r\n<p><i><b>The video stutters or is choppy or I can’t view it reliably at home.</b></i></p>\r\n\r\n<p>Every video upload on Median has up to five \"versions\" created for improved streaming from off-campus locations. These versions range from small, iPhone-compatible quality to full HD high-bandwidth quality. The Median video player works to gauge your available bandwidth and provide you with the appropriate version, and will automatically scale up or down based on your bandwidth. This switching may cause a second or two of buffering in the video player. If you are off campus, it is also possible that wherever you are viewing the media does not have a sufficient connection speed to stream media from Emerson at all.</p>\r\n\r\n<p>If you are the owner of a media entry that is having trouble streaming at a steady rate, click on the \"Advanced Info\" tab below the video to view how many versions are available and their status. If you are experiencing any problems and would like specific advice on your entry, or any entry on Median, please do not hesitate to <a href=\"/contact/\">contact support</a>.</p>\r\n\r\n<p><i><b>My video is playing sideways or upside-down!</b></i></p>\r\n\r\n<p>Most likely this means you recorded it sideways, typically on an iPad or iPhone. When you record in portrait mode or upside-down on your iOS device, it's still recording it literally as if you were in landscape mode. Right now Median has no way of \"knowing\" when there's some other way to orient the video, so it transcodes it and plays it back using the dimensions its given. A future update to Median will attempt to fix this discrepancy. In the meantime, <a href=\"http://www.youtube.com/watch?v=Bt9zSfinwFA\"><b>please shoot video in landscape mode</b></a>.</p>\r\n\r\n<h3>If You Have Any Questions</h3>\r\n\r\n<p>Please feel free to email me about anything relating to Median or video for the web <a href=\"/contact/\">using the Contact Us form</a>.</p>", "k" : "videofaq", "ti" : "Common Video Problems FAQ", "tsc" : 1343403548, "tsu" : { "$numberLong" : "1412264183" }, "v" : 1 }
{ "_id" : { "$oid" : "5012abbed3ef88e703f9d8ac" }, "c" : "<h3>The Short Version</h3>\r\n\r\n<p>Median accepts many video types and codecs, but only one of them will allow you to have your media <b>immediately available for viewing</b>: MP4 file format with H264 video and AAC audio. Additionally, the video must be <b>less than 1900kbps</b> total bitrate, and 720p (1280x720) or lower resolution.  We recommend encoding your media for the web directly from your editing application, or exporting a very high-quality version and then using a program like <a href=\"http://handbrake.fr/\" target=\"_blank\">Handbrake</a> to transcode it to a web-friendly version. There is also a guide to using Handbrake for Median <a href=\"http://it.emerson.edu/page/encoding-with-handbrake-for-median/\">here</a>.</p>\r\n\r\n<h3>The Long Version</h3>\r\n\r\n<h4>Introduction</h4>\r\n\r\n<p>This document is specifically tailored for users who are looking to format their video for use on the web, including platforms like Median, YouTube, and Vimeo. The major video hosting sites of the internet employ standards that are also shared by Median. However, Median does not have the resources of a large post-enterprise application like YouTube. Therefore users are implored to do a little extra work on their end to make their experience with Median more efficient. This guide demonstrates how to use Median in the quickest and simplest fashion possible, while explaining key concepts that affect the use of video on the internet in general.</p>\r\n\r\n<p>For general use, content uploaded to Median is handled in an automated process that is invisible to the user. You simply upload your video, Median transcodes it (usually within 5 minutes), and it's ready to be viewed. For the more technically-inclined person, that process can be made a bit more transparent and hands-on by reading this document.</p>\r\n\r\n<h4>How Video Is Handled On The Web</h4>\r\n\r\n<p>Briefly explained, content uploaded to Median is sorted, analyzed, copied, transcoded, and then served in a secure fashion. The length of time to do this for audio and image uploads is very fast: it takes as long as uploading the media and filling out the Upload Wizard. Once you are done, images and audio are immediately available.</p>\r\n\r\n<p>For video, the process involves an additional analysis and then transcoding. Video delivery systems like YouTube and Vimeo employ this process as well. When a video is uploaded, the media file is checked for what video and audio codecs are used (Quicktime, ProRes, MPEG, WebM, Windows Media, etc), how large the frame dimensions are (width and height), and how much bitrate is used (25 megabit/sec, 800 kilobit/sec, etc). These factors determine whether the file can be immediately viewed in a way that is accessible to the largest population of users, or if the video has to be transcoded to a more accessible format.</p>\r\n\r\n<p>“Transcoding” is the process of copying the existing video file and re-encoding it to a different format, whether it’s resizing the video or changing it from Windows Media format to Quicktime format. Think of it as transferring video footage from a tape to a digital format. It needs to be done to every frame of video, so it takes time.</p>\r\n\r\n<p>On the web, services like YouTube and Median cannot stream raw footage from a high-end camera. The bitrate is far too high, as most broadband users have around a 10 megabit per second connection. One of the standard shooting formats is DV25, which is 25 megabits per second, or ProRes, which can be anywhere from 20 megabits per second to 400 megabits per second. When you know these numbers, it’s easy to tell that 25 megabits per second of video cannot possibly fit through the 10 megabits per second your home connection allows. This is why services like Vimeo automatically transcode your video down to an acceptable level which will work for the broadest range of internet connections. YouTube, for example, encodes several different versions for different bandwidth options (you will notice the little box that lets you choose 480p, 720p, 1080p, etc, in YouTube’s player). Median features the same process.</p>\r\n\r\n<p>The main difference between Median and services like Vimeo is that Median currently has only a handful of servers that transcode uploaded video files for users. Each can be doing one video at a time. YouTube, on the other hand, has thousands of servers encoding media at blinding speeds, meaning when you upload something it is encoded in as little as 30 seconds. On Median, the process can take anywhere from 5 minutes to 24 hours depending on how many other videos are being processed. This is why Median users are encouraged to do a little more work on their end to make sure their videos can be immediately accessible if time is a factor.</p>\r\n\r\n<p>When transferring footage from a tape to a digital file, usually it is captured at a 1:1 ratio. For every second on the tape, it takes a second to transfer it to a digital file. Converting from a digital format to another digital format, on the other hand, is only limited to the computing power available. So converting a 30-minute DV25 file to a 800kbps H.264 file can take only five minutes on a fast computer, or it can take an hour on a slow computer. </p>\r\n\r\n<p>For this purpose, Median has a “fast lane” option for video uploads. If you upload your video in the correct format, Median will skip that transcoding process entirely and make your video immediately available for viewing. However, getting your encoding process to work well is not easy for someone who has little to no experience with video codecs and bitrates. This guide aims to help you with that.</p>\r\n\r\n<h4>A Quick Glossary Of Terms</h4>\r\n\r\n<p><i><b>Codec</b></i> - the algorithm used to compress either the audio or video portion of a file. Different codecs compress differently. Some codecs, like Quicktime Animation, preserve a lot of image quality and result in large files. Other codecs, like H.264, are designed to make a very small file that preserves as much quality as possible. MP3 is another codec you’ve probably heard of.</p>\r\n\r\n<p><i><b>Bitrate</b></i> - how much data is used per increment of time, usually seconds. There are various ways to measure it, but usually it’s in kilobits per second or megabits per second. This has nothing to do with the frame size of the video frame and has everything to do with the file size of the video.</p>\r\n\r\n<p><i><b>Bits versus bytes</b></i> - bitrates are typically measured in bits, not bytes. A megabyte is typically used to describe the size of a file, but megabit is commonly used for transmission speeds. A bit is a single 1 or 0, while a byte is eight bits. Really, you shouldn’t worry about it. Bitrate is about kilobits and megabits, the size of files are about kilobytes and megabytes. Bits are usually in lowercase and bytes are in uppercase: kbps is kilobits per second, KBps are kilobytes per second.</p>\r\n\r\n<p><i><b>480p, 720p, etc</b></i> - these are just shortcuts to describe a video’s frame size. 480 and 720 are how many horizontal lines of resolution there are. In the computer world, this translates to pixels (720p means 720 pixels high, even though this is still sometimes not true). The small “p” means that the video has progressive frames instead of interlaced frames. If you see a small “i”, that means the video is interlaced instead of progressive. Honestly, they don’t mean anything in the online world (and on Blu-ray movies) because technically contemporary video is made up of interlaced frames, full progressive frames, B-frames, P-frames, I-frames, and more, all working together to make the best picture possible.</p>\r\n\r\n<h4>The “Art” of Encoding</h4>\r\n\r\n<p>It’s not really an art, but it does require a certain level of finesse, it varies for every video, and generally requires some trial-and-error before you get the results you might want. However, there are best practices for almost every situation:</p>\r\n\r\n<p><i><b>Frame Dimensions versus Bitrate</b></i></p>\r\n\r\n<p>When encoding video, the encoder is in a continuous battle with how much space there is to fit each pixel (the height and width of the video frame) and how much the maximum allowable bitrate is per frame. Look at it this way: you have a ten-by-ten square that makes up 100 blocks total surface area. You can have a maximum of 50 blocks in that ten-by-ten square to make an image. How do you do it best? This is analogous to having a 10 by 10 pixel video frame (100 pixels total) and only 50 bits per frame of bitrate. </p>\r\n\r\n<p>Now let’s make it bigger, more realistic: you have a 1080p24 video file, that’s 1920 pixels wide by 1080 pixels high at 24 frames each second. That’s around 2.14 million pixels, 24 times each second. And you have 800 kilobits per second, or 33.3 kilobits per frame. That’s 33,300 bits for all 2.14 million pixels each frame. There’s nowhere near enough storage in each frame to make a good looking video. So you have to change one of those variables to make it look better, whether it’s the frame size or the bitrate or the frames per second. And this is all in the effort of making a small, compact file that is easily streamed over the internet, so you can’t increase the bitrate.</p>\r\n\r\n<p>Decreasing the frame dimensions is an easy way to fix that problem. Video resolutions of 720p and 1080p were never streamed by YouTube until 2008, and they arguably still do not have broadcast-quality bitrates to support it. Decreasing the video size from full HD quality 1920 pixels by 1080 pixels to DVD quality of 720 pixels by 480 pixels (or 480p) drops the number of pixels per frame from 2.14 million to 345,600. So when you have a bitrate of 33,300 bits per frame, the image starts to look a lot better. Yes, the frame size is smaller, but the image looks a lot better. You have to sacrifice somewhere for internet streaming video.</p>\r\n\r\n<p><i><b>Video and Audio Bitrates</b></i></p>\r\n\r\n<p>Video and audio both have bitrates, but in most viewing applications and in terms of streaming over the internet, they only matter as a total combined bitrate. This means that there is wiggle room in terms of what takes most of that total bitrate. The video will always have a vastly higher bitrate, typically audio bitrates for web video do not go above 128 kilobits per second, whereas video will go up to 2,000 kilobits per second.  But when dealing with a limiting situation, like a constraint of 800 kilobits per second, an extra 50 kilobits for video might make the image look a bit better. Typically I encourage users to use 700kbps for video and 96kbps for audio. But you could easily change that to 750kbps for video and 64kbps for audio and hear no substantial difference. It’s worth trying.</p>\r\n\r\n<p><i><b>Multi-pass or Two-pass Encoding</b></i></p>\r\n\r\n<p>One of the least used but most beneficial ways to make your video look better is to use multi-pass (AKA two-pass) encoding. The explanation is simple: the encoder does a first pass of the entire video which merely analyzes each frame and determines how best to use those 800kbps of space you have for each frame. On the second pass, the encoder actually makes that happen. What’s even more important is that the H.264 video codec (which is the standard video codec for the web) provides predictive frames and B-frames. So that first pass not only analyzes each frame, but examines its relation to frames before and after it, and saves space based on that relationship.</p>\r\n\r\n<p>For example, if you have a ten-second shot of an interview when the background never changes, just the person’s head, the first pass will recognize this. It will know that certain sections of the video don’t change for an extended period of time, meaning it won’t have to redraw them in each frame. The video will essentially have one frame of the background and then dedicate all the bitrate-per-frame to just the person’s face and their head movements, making the overall quality much better.</p>\r\n\r\n<p>However, two-pass encoding has two drawbacks. First, because it is making two passes instead of one, the encoder will take anywhere from 1.5 to 2 times longer to do the whole process than if you had a single-pass encode. Secondly, multi-pass encoding sometimes doesn’t do much to help any fast-paced action where the video content is constantly changing. It helps a little bit, but the overall limitation of 800kbps can be too stifling. </p>\r\n\r\n<p>Even with these drawbacks, multi-pass encoding is worth it, and most machines will run that first pass very quickly since it’s not actually encoding the media yet, it’s only looking at the file.</p>\r\n\r\n<h4>Recommended Transcoding Software</h4>\r\n\r\n<p>Let me reiterate that transcoding is about trial-and-error when you're starting out. It's about finding a workflow that is comfortable for you. I recommend exporting from whatever source you're working with (Final Cut Pro, Avid, etc) a high-quality version of your video and then using one of the following tools to transcode it for web-readiness. Many video editing programs have good export functions, some of which I'll cover here.</p>\r\n\r\n<ul>\r\n<li><a href=\"http://handbrake.fr/\" target=\"_blank\"><b>Handbrake</b></a> is by far the simplest and quickest to use. It is available for Windows, Mac, and Linux. It is actually what Median's transcoding servers use to encode video since it is free and uses open-source encoders for H.264 and AAC, known as x264 and FAAC respectively. It is available on every lab computer on campus.</li>\r\n<li><b>Quicktime Pro 7</b> is a decent and fairly straightforward encoder, available on all the Macs in computer labs on campus. Currently it does not have adequate support for multiple processor cores, so it can take significantly longer than using Handbrake. However, it uses the Apple encoders for H.264 and AAC, which sometimes give a small boost in overall image quality. Quicktime Pro 7 is officially not really supported on Snow Leopard and beyond, as it has been replaced by Quicktime X (which has no custom transcoding functionality) and it costs money if you'd like a personal copy.</li>\r\n<li><b><a href=\"http://www.macroplant.com/adapter/\">Adapter</a></b> is a very easy to use encoder, available on Mac and Windows. It uses the same kind of engine as Handbrake, so it produces similar results at a good speed.</li>\r\n<li><a href=\"http://www.mediacoderhq.com\" target=\"_blank\"><b>MediaCoder</b></a> is a Windows-only transcoding suite for desktop and devices. It's decent, but it's much more convoluted than Handbrake.</li>\r\n<li><b>Compressor</b> is built in to the Final Cut Studio suite, and is a valuable transcoder if you have the time to figure it out. It can be a bit complex, but seasoned Compressor users should be able to fit Median's parameters into it without a problem.</li>\r\n</ul>\r\n\r\n<h4>The Parameters for Median</h4>\r\n\r\n<p>That having all been said, here are the guidelines for Median instant availability. </p>\r\n\r\n<ul>\r\n<li>File format/container: .mp4</li>\r\n<li>Recommended total average bitrate: 1800 kbps</li>\r\n<li>Video codec: H.264 (or x264 if you are using Handbrake)</li>\r\n<li>Video frame: non-anamorphic, 1:1 pixel ratio</li>\r\n<li>Audio codec: AAC (or FAAC or AAC CoreAudio if you are using Handbrake)</li>\r\n<li>Audio sample rate: 44.1 khz</li>\r\n</ul>\r\n\r\n<p>If it fits those parameters, it’ll be available immediately for viewing after uploading to Median. Note that these parameters may change in future versions, but what’s probably going to change is the recommended total bitrate. As broadband speeds grow, so do allowable bitrate speeds.</p>\r\n\r\n<h4>If You Have Any Questions</h4>\r\n\r\n<p>Please feel free to email me about anything relating to Median or video for the web by <a href=\"/contact/\">Contacting Us</a></p>", "k" : "webvideo", "ti" : "Video for the Web", "tsc" : 1343403548, "tsu" : { "$numberLong" : "1424446144" }, "v" : 1 }
{ "_id" : { "$oid" : "5012abd0d3ef88e703f9d8ad" }, "c" : "<p>Every media entry has an embeddable player. On the media entry's player page, under the media, click the <b>Sharing</b> button and copy the <b>Embed Code</b>. You can place this HTML anywhere and it will play the media entry.</p>\r\n\r\n<p>Please be aware that all security settings follow the player, so something that is not publicly viewable on Median will also not be publicly viewable from the embedded player.</p>", "k" : "embedding", "ti" : "Embedding Media Elsewhere", "tsc" : 1343403548, "tsu" : 1346072032, "v" : 1 }
{ "_id" : { "$oid" : "5012abe2d3ef88e703f9d8ae" }, "c" : "<p>The Median API is freely available for anyone to use, and has its own documentation here: <a href=\"/api/\">API docs</a>.</p>", "k" : "api", "ti" : "The Median API", "tsc" : 1343403548, "tsu" : 1346072211, "v" : 1 }
{ "_id" : { "$oid" : "5033c9a834fab604936ec28c" }, "c" : "<p>While we do not actively monitor Median entries for potentially copyright infringing content, we will contact the uploader of the media entry should any copyright infringement request be received by Emerson College, or if in the course of administrative duties someone discovers a potentially copyright infringing entry. Users are encouraged to use the <a href=\"http://fairuse.emerson.edu/\" target=\"_blank\">Fair Use utility</a> to ascertain whether their content follows copyright restrictions and fair use guidelines.</p>\r\n\r\n<p>Median also adheres to all of Emerson College's <a href=\"http://www.emerson.edu/policy\" target=\"_blank\">other policies</a>.</p>", "k" : "copyright", "ti" : "Copyright Infringement Policy", "tsc" : 1345571266, "tsu" : 1346072171, "v" : 1 }
{ "_id" : { "$oid" : "507700af4c79f5313400012d" }, "c" : "<p>Median currently only accepts uploads of <b>44.1Khz MP3 files</b> for audio entries. Audio bitrate can be anywhere from 96kbps to 256kbps. Formats like FLAC and WAV and AAC are not supported.</p>", "k" : "audiofiles", "ti" : "Uploading Audio Files", "tsc" : 1349976239, "tsu" : 1349976239, "v" : { "$numberLong" : "1" } }
{ "_id" : { "$oid" : "50880a5d00e19a5c0500023b" }, "c" : "<p>Median supports the latest versions of all major browsers (Chrome, Firefox, Safari, Opera, Internet Explorer) for all content on Median except uploading. Any version of Chrome, Firefox 3.5+, Safari, Opera, and Internet Explorer 8+, should work fine with Median. Internet Explorer may look and act a little quirky, because IE doesn't properly support a lot of existing standards, but everything should still be accessible. If you experience any problems with Median, please <a href=\"/contact/\">let us know</a>.</p>\r\n\r\n<p>For the Median <b>Uploader</b> and <b>File Swap</b> pages, Median only supports Chrome, Firefox 3.5+, Safari, and Opera. Internet Explorer is not supported in any way, as it does not support the standards that allow batch and large file uploads.</p>", "k" : "supportedbrowsers", "ti" : "Supported Browsers", "tsc" : 1351092829, "tsu" : 1351092851, "v" : { "$numberLong" : "1" } }
{ "_id" : { "$oid" : "5112b38800e19a6412000009" }, "c" : "<p>Using Median to publish podcasts is easy! Every user, category, playlist, group, etc, has built-in iTunes-compatible RSS feeds available through Median. Any audio or video file will be iTunes-compatible through Median's backend transcoding.</p>\r\n\r\n<p>For example, the <a href=\"http://median.emerson.edu/category/59/\" target=\"_blank\">entire ETIN category</a> has an RSS feed available <a href=\"http://median.emerson.edu/rss/category/59/\" target=\"_blank\">here</a>.</p>\r\n\r\n<p>To do this, you must make sure the settings on your media entries are as follows:</p>\r\n\r\n<ol>\r\n<li>You must use an open license like a <b>Creative Commons</b> license or <b>Public Domain</b>.</li>\r\n<li>The \"Restricted to\" field, below the licensing options, must be set to <b>Publicly Accessible</b>, not \"Just Emerson College\" or any other option.</li>\r\n</ol>\r\n\r\n<p>When these conditions are met, your content will automatically be available in the RSS feed for whatever channel you've added the entry to. You can find a link to the RSS feed by clicking the orange RSS feed button in the top-right of any Listing page.</p>\r\n\r\n<p>Additionally, feel free to use third-party services like Feedburner to get in-depth analytics on your RSS feeds, as Median does not provide this functionality.</p>", "k" : "podcasting", "ti" : "Podcasting on Median", "tsc" : 1360180104, "tsu" : 1360180314, "v" : { "$numberLong" : "1" } }
{ "_id" : { "$oid" : "515051c84c79f54615000074" }, "c" : "<p><i><b>My videos are taking forever to upload!</b></i></p>\r\n\r\n<p>There are a lot of reasons why an upload would take a long time to go from your computer to Median's servers. Here are a few of the most common reasons:</p>\r\n\r\n<ul>\r\n<li><b>Poor connection speed.</b> This could be due to being on a wireless network, or off-campus, or some other kind of network instability. This is largely outside of your control, so there's not a lot you can do. The guaranteed fastest connection you can have to Median is to be <b>on-campus</b> in a computer lab, at a staff desk, or in a classroom. When you are off-campus, your upload speed will be significantly slower than if you were on-campus.</li>\r\n<li><b>Large file size.</b> Uploading a 4GB video file to Median will take time, there's nothing anyone can do about that. Please note that the <i>duration</i> of a video does not necessarily have anything to do with how long it will take to upload. However, if you are uploading a 10-minute long video that's 2GB, you can probably make that file size a lot smaller before uploading it to Median. To learn more about how to make your video file size smaller, read <a href=\"/help/webvideo/\">the guide on video for the web</a>.</li>\r\n<li><b>Median is under heavy load.</b> This happens very rarely, and usually only during finals week, but it can be the cause of some slowness. However, this will be apparent on all sections of Median, not just the uploader. If Median is acting erratically or noticeably slowly, please <a href=\"/contact/\">contact us</a> immediately.</li>\r\n</ul>\r\n\r\n<p><i><b>How can I make a YouTube-like channel?</b></i></p>\r\n\r\n<p>There are a lot of features in Median that can accomplish this. First, every user can create \"Playlists\" by clicking \"Manage Your Content\" at the <a href=\"/\">Median home page</a> and then clicking on the \"Playlists\" link above your entries. These are personal playlists, just for you. If you want to create a list of entries that's controlled by not just yourself, start a Group by clicking \"Groups\" at the <a href=\"/\">Median home page</a> and then finally click the \"Start a New Group\" button. You can add new entries or existing entries to your playlists or groups.</p>\r\n\r\n<p><i><b>How do I make my entry visible only to X but not to Y?</b></i></p>\r\n\r\n<p>Every entry on Median has complex access controls that can help set who can see your entry. When uploading a new entry or editing an existing one, these options are found in the <b>Privacy & Ownership</b> section. That's where you can set who owns the entry, who can see the entry, and whether to password-protect or hide the entry entirely. For example, if you want to restrict an entry just to your class, you can select your class from the dropdown in the <b>Organization</b> section, and then later in the form check off <b>Restrict to Class</b>.</p>\r\n\r\n<p><i><b>How long can my entries \"live\" on Median?</b></i></p>\r\n\r\n<p>Your content can exist on Median at least as long as you have a valid Emerson College account. If any content on Median by people no longer at Emerson is deleted, such action will be preceded by standard account deletion notifications sent by Information Technology.</p>", "k" : "medianfaq", "ti" : "General Median FAQ", "tsc" : 1364218312, "tsu" : { "$numberLong" : "1412264270" }, "v" : { "$numberLong" : "1" } }
{ "_id" : { "$oid" : "525310d04c79f5f6600000e9" }, "c" : "<p>Median automatically transcodes all videos up to four times, depending on the bitrate of what you uploaded. One of these is a <strong>mobile-ready</strong> version, which is low quality for easy playback over cellular networks and small screens. By default, when you view a video on Median on a desktop/laptop computer, you are viewing it via a Flash-based player. This ensures that you are <strong>streaming</strong> the video content rather than downloading it (which is how YouTube works). Streaming ensures a level of security and affords easier dynamic switching to higher-quality versions of the video. Some <strong>Android</strong> phones have built-in support for Flash, so you can view videos on them the same way you could on the desktop. Currently, only iOS devices (iPhone, iPad, iPod Touch) are treated differently for mobile playback, since iOS has no support for Flash. </p>\r\n\r\n<p>When viewing videos on <strong>iOS</strong>, you must actually be downloading the video for it to work correctly. This presents a security problem for videos that are restricted to the Emerson community, or are otherwise restricted to classes or certain users on Median because of copyright concerns. Therefore, <strong>you cannot view any non-public video on an iOS device</strong>.</p>\r\n\r\n<p>If you have uploaded a video of your own creation and you'd like to make it iOS-accessible, you must set your <em>Privacy & Ownership</em> settings like so:</p>\r\n\r\n<ul>\r\n<li>The entry's <strong>License Type</strong> must be Creative Commons or Public Domain, <em>or</em> you must be the owner of content and then you can make a Copyrighted work public.</li>\r\n<li>The entry's <strong>Restricted To</strong> field must be set to <em>Publicly Accessible</em>. This option is only available if the above condition is met. You <strong>cannot</strong> make an entry publicly accessible if it is a copyrighted work that is not yours.</li>\r\n<li>The entry must <strong>not</strong> be restricted to a class or group, and must not be password protected.</li>\r\n</ul>\r\n\r\n<p>If your entry meets the above requirements, it will be 100% mobile-accessible via the HTML5 <em>video</em> tag, which is supported on most major mobile browsers.</p>\r\n\r\n<p><strong>Note:</strong> the above settings also apply to <strong>audio entries</strong> that you'd like to make mobile-ready.</p>", "k" : "medianmobile", "ti" : "Median on Mobile Devices", "tsc" : 1381175504, "tsu" : { "$numberLong" : "1412264293" }, "v" : { "$numberLong" : "1" } }
{ "_id" : { "$oid" : "5348104c4c79f562628b4ca9" }, "c" : "<p>Emerson strives to be compliant and accommodate students wherever necessary and in any way possible. With Median, we have set up a partnership with <a href=\"http://www.amara.org\">Amara.org</a>, an open source non-profit, which has provided us with tools to caption our online media.</p>\r\n\r\n<b><h4>Options for Closed Captioning in Median</h4></b>\r\n<p>To enable captions all the time, <b>go to Homepage > Manage Your Content > Account Options > Enable subtitles when available</b></p>\r\n<p>A video on Median that has been captioned will have a \"CC\" button in the lower-right of the video player, which you can click to toggle subtitles. If you enable subtitles at the account level using the above option they will show up automatically wherever available, on Median and on Median embedded videos.</p>\r\n\r\n<h4>Using Closed Captions</h4>\r\n<p>By default, a video will not display captions unless you have enabled subtitles at the account level in Median (see above) or clicked on the \"CC\" button on the Median video player.<p>\r\n\r\n<p>If you want to ensure your embedded video have closed captioning enabled, simply add <b>?cc=1</b> to the end of your Median embed code URL.</p>\r\n\r\n<p><b>Example: https://median.emerson.edu/embed/#####/?cc=1</b></p>\r\n\r\n<p>If you have variables like <i>autoplay</i> already in the URL, simply change it to <b>&cc=1</b></p>\r\n\r\n<p><b>Example: https://median.emerson.edu/embed/#####/?ap=1&cc=1</b></p>\r\n\r\n<b><h4>How do I add closed captioning to my video?</h4></b>\r\n<p>Currently, closed captioning can only be done by authorized users. Please do not hesitate to contact <a href=\"http://www.emerson.edu/academics/academic-services/disability-services\">Disability Services</a> if you require any specific accommodations.</p>", "k" : "accessibility", "ti" : "Accessibility and Closed Captioning", "tsc" : 1397231692, "tsu" : { "$numberLong" : "1424446633" }, "v" : { "$numberLong" : "1" } }
